In [1]:
# Importing sqltie
import sqlite3

In [2]:
# Creating the connection object.
conn = sqlite3.connect('example.db')

In [4]:
# Creating cursor object to execute the sqlite3 statements.
cursor = conn.cursor()

In [17]:
# Now we can use the cursor to call the execute() method to execute any SQL queries.
sql = '''CREATE TABLE EMPLOYEE(
    FIRST_NAME CHAR(20) NOT NULL,
    LAST_NAME CHAR(20),
    AGE INT NOT NULL,
    SEX CHAR(1), 
    INCOME FLOAT
)'''

In [25]:
# Create table using CREATE TABLE
cursor.execute(sql)

In [26]:
# Call commit to save changes to the database
conn.commit()

In [31]:
# selecting the schema of the employee table
data = cursor.execute('PRAGMA table_info(employee)')
print(data.fetchall())

[(0, 'FIRST_NAME', 'CHAR(20)', 1, None, 0), (1, 'LAST_NAME', 'CHAR(20)', 0, None, 0), (2, 'AGE', 'INT', 1, None, 0), (3, 'SEX', 'CHAR(1)', 0, None, 0), (4, 'INCOME', 'FLOAT', 0, None, 0)]

In [122]:
# Insert employees data sent in an array into the employee table
def insert_employee(employees):
    print(employees)
    sql = "INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES "
    for employee in employees:
        print(employee)
        sql = sql + "('" + employee["first_name"] + "','" + employee["last_name"]  + "','" + employee["age"]  + "','" + employee["sex"] + "','" + employee["income"] + "'),"
        print(sql)
    sql = sql[:-1]
    print(sql)
    result = cursor.execute(sql)

In [145]:
# calling insert employee method to insert employee
data = insert_employee([{"first_name":"sunil", "last_name":"rai", "age": "111", "sex": "M", "income": "1000000"}, {"first_name":"sabnam", "last_name":"rai", "age": "111", "sex": "F", "income": "100000"}])

# gets all the affected rows and total affected rows.
affectedrows = cursor.execute('select changes(),total_changes()')
affectedrows.fetchall()

[{'first_name': 'sunil', 'last_name': 'rai', 'age': '111', 'sex': 'M', 'income': '1000000'}, {'first_name': 'sabnam', 'last_name': 'rai', 'age': '111', 'sex': 'F', 'income': '100000'}]
{'first_name': 'sunil', 'last_name': 'rai', 'age': '111', 'sex': 'M', 'income': '1000000'}
INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES ('sunil','rai','111','M','1000000'),
{'first_name': 'sabnam', 'last_name': 'rai', 'age': '111', 'sex': 'F', 'income': '100000'}
INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES ('sunil','rai','111','M','1000000'),('sabnam','rai','111','F','100000'),
INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES ('sunil','rai','111','M','1000000'),('sabnam','rai','111','F','100000')

[(2, 24)]

In [170]:
#fetching employee data from employee table
all_employee_data = cursor.execute('SELECT * FROM EMPLOYEE')

In [142]:
# retrieves an employee data from the table
all_employee_data.fetchone()

('sunil', 'rai', 111, 'M', 1000000.0)

In [131]:
all_employee_data.fetchone()

In [171]:
#sets the limit while fetching data. default is 1.
all_employee_data.fetchmany(5)

[('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0)]

In [168]:
# retrieves all the employee data from the table
all_employee_data.fetchall()

[('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sabnam', 'rai', 'F', 100000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sabnam', 'rai', 'F', 100000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sabnam', 'rai', 'F', 100000.0)]

In [149]:
#fetching female employee
female_employee_data = cursor.execute("SELECT * FROM EMPLOYEE WHERE SEX = 'F'")

# retrieves all the female employee data from the table
female_employee_data.fetchall()

[('sabnam', 'rai', 111, 'F', 100000.0),
 ('sabnam', 'rai', 111, 'F', 100000.0),
 ('sabnam', 'rai', 111, 'F', 100000.0)]

In [153]:
# updates age by 1 more year in the current age of all male employee.
male_employee_data = cursor.execute("UPDATE EMPLOYEE SET AGE = AGE + 1 WHERE SEX = 'M'")

# retrieves all the male employee data from the table
male_employee_data = cursor.execute("SELECT * FROM EMPLOYEE WHERE SEX = 'M'")
male_employee_data.fetchall()

[('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunils', 'rais', 1115, 'M', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunils', 'rais', 1115, 'M', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunils', 'rais', 1115, 'M', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunils', 'rais', 1115, 'M', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunils', 'rais', 1115, 'M', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunils', 'rais', 1115, 'M', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunils', 'rais', 1115, 'M', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunils', 'rais', 1115, 'M', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunils', 'rais', 1115, 'M', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0)]

In [154]:
# delete employee whose age is greater than 115.
cursor.execute("DELETE FROM EMPLOYEE WHERE AGE > 115")


# retrieves all the male employee data from the table
employee_data = cursor.execute("SELECT * FROM EMPLOYEE")
employee_data.fetchall()

[('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sabnam', 'rai', 111, 'F', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sabnam', 'rai', 111, 'F', 100000.0),
 ('sunil', 'rai', 115, 'M', 1000000.0),
 ('sabnam', 'rai', 111, 'F', 100000.0)]

In [157]:
# drop age column
cursor.execute("ALTER TABLE EMPLOYEE DROP COLUMN AGE")


# retrieves all the male employee data from the table
employee_data = cursor.execute("SELECT * FROM EMPLOYEE")
employee_data.fetchall()

[('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sabnam', 'rai', 'F', 100000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sabnam', 'rai', 'F', 100000.0),
 ('sunil', 'rai', 'M', 1000000.0),
 ('sabnam', 'rai', 'F', 100000.0)]

In [163]:
# fetching the data from sql table into dataframe.
import pandas as pd
df = pd.read_sql('SELECT DISTINCT FIRST_NAME, LAST_NAME, SEX, INCOME FROM EMPLOYEE', conn)

In [164]:
df

  FIRST_NAME LAST_NAME SEX     INCOME
0      sunil       rai   M  1000000.0
1     sabnam       rai   F   100000.0

In [172]:
import pymongo

ModuleNotFoundError: No module named 'pymongo'